app/views/questions/index.html.erb

SELECT "questions".* FROM "questions"  WHERE "questions"."user_id" = ?  [["user_id", 2]]
SELECT  "results".* FROM "results"  WHERE "results"."question_id" = ?  ORDER BY "results"."id" ASC LIMIT 1  [[nil, 1]]
SELECT COUNT(*) FROM "results" INNER JOIN "answers" ON "results"."answer_id" = "answers"."id" WHERE "answers"."question_id" = ?  [["question_id", 2]]
---
    <tbody>
      <% current_user.questions.each do |question| %>
        <tr>
          <td><%= link_to question.content, question.results.first %></td>
          <td><%= question.results.count %></td>

SELECT "results".* FROM "results"  WHERE "results"."user_id" = ?  [["user_id", 1]]
---
    <tbody>
      <% current_user.results.each do |result| %>