app/views/questions/show.html.erb

SELECT "results".* FROM "results" INNER JOIN "answers" ON "results"."answer_id" = "answers"."id" WHERE "answers"."question_id" = ?  [["question_id", 3]]
SELECT COUNT(*) AS count_all, answer_id AS answer_id FROM "results" INNER JOIN "answers" ON "results"."answer_id" = "answers"."id" WHERE "answers"."question_id" = ? GROUP BY answer_id  [["question_id", 2]]
---
      <% if @question.multiple_choice? %>
        <%= pie_chart @question.results.group(:answer_id).count %>

SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = ?  [["question_id", 2]]
SELECT COUNT(*) FROM "answers"  WHERE "answers"."question_id" = ?  [["question_id", 4]]
---

  <%= card(@question.answers.count, 'ANSWERS RECEIVED', 'right') %>