app/views/users/show.html.erb

SELECT "questions".* FROM "questions"  WHERE "questions"."user_id" = ?  [["user_id", 1]]
---
    <tbody>
    <% current_user.questions.each do |question| %>

SELECT "results".* FROM "results"  WHERE "results"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "results" INNER JOIN "answers" ON "results"."answer_id" = "answers"."id" WHERE "answers"."question_id" = ? AND "results"."user_id" = 1  [["question_id", 8]]
---
          <td><%= link_to question.content, question %></td>
          <td><%= question.results.count %></td>