app/views/results/show.html.erb

SELECT  "answers".* FROM "answers"  WHERE "answers"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
SELECT "results".* FROM "results" INNER JOIN "answers" ON "results"."answer_id" = "answers"."id" WHERE "answers"."question_id" = ? GROUP BY answer_id  [["question_id", 1]]
SELECT COUNT(*) AS count_all, answer_id AS answer_id FROM "results" INNER JOIN "answers" ON "results"."answer_id" = "answers"."id" WHERE "answers"."question_id" = ? GROUP BY answer_id  [["question_id", 1]]
---

<%= bar_chart @result.answer.question.results.group(:answer_id).count %>