app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"   ORDER BY "questions"."duedate" ASC
---
  def index
    @questions = Question.order(:duedate)

INSERT INTO "questions" ("content", "created_at", "duedate", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "New question added"], ["created_at", "2014-06-28 20:57:04.533409"], ["duedate", "2014-06-29"], ["updated_at", "2014-06-28 20:57:04.533409"], ["user_id", 1]]
---
  def create
    @question = Question.new(question_params)
    @question.user_id = current_user.id
    respond_to do |format|
      if @question.save