app/controllers/results_controller.rb

  def create
    @result = Result.new(result_params)

    respond_to do |format|
      if @result.save
---
INSERT INTO "results" ("answer_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["answer_id", 9], ["created_at", "2014-06-28 19:42:50.046980"], ["updated_at", "2014-06-28 19:42:50.046980"], ["user_id", 2]]

    def set_result
      @result = Result.find(params[:id])
---
SELECT  "results".* FROM "results"  WHERE "results"."id" = ? LIMIT 1  [["id", 1]]