app/controllers/users_controller.rb

  def show
    @questions = Question.order(:duedate)
---
SELECT "questions".* FROM "questions"   ORDER BY "questions"."duedate" ASC

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_user
      @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 7]]